{
    "comedy":   {
        "title": "Comedy Movies",
        "intro": "Always a good laugh with these titles",
        "movies": [
            {
                "title": "Anchorman: The Legend of Ron Burgundy",
                "plot": "Plot: Will Ferrel (Old School, Elf) is Ron Burgundy, a top-rated 1970's San Diego anchorman who believes women have a place in the newsroom - as long as they stick to covering fashion shows or late-breaking cooking stories. So when ron is told he'll be working with a bright young newswoman (Christina Applegate) who's beautiful, ambitious and smart enough to be more than eye candy, it's not just a clash of two TV people with really great hair - it's war! Filled with wicked wit and slapstick humor, Anchorman is the year's most wildly irreverent, must-see comedy hit!
                Rated PG-13 by the Motion Picture Association of America.",
                "price": "$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/6131.jpg",
                "cast": "Will Ferrell, Steve Carell, David Koechner, Paul Rudd, Fred Willard, Christina Applegate"
            },

            {
                "title": "Super Troopers 2",
                "plot": "Plot: Everyone's favorite law enforcement team is back by popular demand with the follow up to the cult comedy classic...SUPER TROOPERS. When a border dispute arises between the U.S. and Canada, Super Troopers- Mac, Thorny, Foster, Rabbit and Farva, are called in to set up a new Highway Patrol station in the disputed area. Unconventional police work follows, and the result is…SUPER TROOPERS 2.
                Rated R by the Motion Picture Association of America.",
                "price": "$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/203382.jpg",
                "cast": "Kevin Heffernan, Steve Lemme, Paul Soter, Erik Stolhanske, Marisa Coughlan, Tyler Labine, Jay Chandrasekhar, Rob Lowe, Hayes MacArthur, Will Sasso"
            },

            {
                "title": "Game Night",
                "plot": "Plot: When a fictional murder-mystery game turns into a real kidnapping, hypercompetitive couple Max and Annie must lead their wacky and wildly unqualified group of game-night friends to rescue Max's brother in this terrific action comedy.
                Rated R by the Motion Picture Association of America.",
                "price": "$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/202784.jpg",
                "cast": "Jason Bateman, Rachel McAdams"
            },

            {
                "title": "Despicable Me 3",
                "plot": "Plot: ILLUMINATION, who brought audiences the worldwide blockbusters Despicable Me, Despicable Me 2 and Minions, continues the adventures of Gru, Lucy, their adorable daughters — Margo, Edith and Agnes — and the Minions. Joining Steve Carell and Kristen Wiig in Despicable Me 3 is Trey Parker as Balthazar Bratt, a former child star who's grown up to become obsessed with the character he played in the '80s, and proves to be Gru's most formidable nemesis to date.
                Rated PG by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/202778.jpg",
                "cast": "Trey Parker, Kristen Wiig, Steve Coogan, Steve Carell, Miranda Cosgrove"
            },

            {
                "title": "Life Of The Party",
                "plot": "Plot: When her husband suddenly dumps her, longtime dedicated housewife Deanna (Melissa McCarthy) turns regret into re-set by going back to college…landing in the same class and school as her daughter, who’s not entirely sold on the idea. Plunging headlong into the campus experience, the increasingly outspoken Deanna-now Dee Rock-embraces freedom, fun, and frat boys on her own terms, finding her true self in a senior year no one ever expected.
                Rated PG-13 by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/202793.jpg",
                "cast": "Melissa McCarthy, Ben Falcone"
            }

        ]
    },
    "Drama":   {
        "title": "Drama",
        "intro": "Some of these movies may make you cry",
        "movies": [
            {
                "title": "The Yellow Birds",
                "plot": "Plot: Against the explosive backdrop of the Iraq War, young soldiers Brandon Bartle (Alden Ehrenreich) and Daniel Murphy (Tye Sheridan) forge a deep bond of friendship. When tragedy strikes the platoon, one soldier must return home to face the hard truth behind the incident, and help a grieving mother (Jennifer Aniston) find peace. With a compelling mix of battle action and poignant drama, The Yellow Birds is an unforgettable movie whose power resonates long after the final frame.
                Rated R by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/204841.jpg",
                "cast": "Jennifer Aniston, Alden Ehrenreich, Renee Willett, Toni Collette, Tye Sheridan, Jack Huston"
            },

            {
                "title": "God's Not Dead: A Light in Darkness",
                "plot": "Plot: A church located on a state-university campus is burned down. The school's leadership uses the tragedy to push the church off campus, forcing its faltering pastor to reach out to his estranged lawyer brother for help as he confronts the community's anger towards him and his church.
                Rated PG by the Motion Picture Association of America for Mature Theme, Thematic Elements, Violence.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/203288.jpg",
                "cast": "David A.R. White, John Corbett, Ted McGinley, Shane Harper, Jennifer Taylor, Samantha Boscarino, Tatum O'Neal, Gregory Alan Williams, Shwayze, Benjamin Onyango"
            },

            {
                "title": "Deepwater Horizon",
                "plot": "Plot: Riveting docudrama about the Deepwater Horizon disaster, the 2010 oil-rig explosion that resulted in the largest offshore oil spill in U.S. history. The film depicts the challenges that the rig's crew faced as they fought for survival.
                Rated PG-13 by the Motion Picture Association of America for prolonged intense disaster sequences and related disturbing images.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/200082.jpg",
                "cast": "Mark Wahlberg, Kurt Russell, John Malkovich, Gina Rodriguez, Dylan O'Brien"
            },

            {
                "title": "The Accountant",
                "plot": "Plot: A math genius works as a financial consultant for criminal organizations in this intelligent thriller. While being investigated by the Treasury Department, he agrees to help an accounting clerk look into fraud at her company, but the assignment will prove far more dangerous than he could have ever anticipated.
                Rated R by the Motion Picture Association of America for strong violence and language throughout.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/200096.jpg",
                "cast": "Ben Affleck, Anna Kendrick, J.K. Simmons, Jon Bernthal, Cynthia Addai-Robinson"
            },

            {
                "title": "Shock and Awe",
                "plot": "Plot: Based on true events, President George W. Bush makes a statement about Saddam Hussein's possession of weapons of mass destruction. Knight Ridder journalists question the American president's claims during the events that lead up to the Iraq War in 2003.
                Rated R by the Motion Picture Association of America for Language, Sexual Situations.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/205518.jpg",
                "cast": "Woody Harrelson, Rob Reiner, Tommy Lee Jones, James Marsden, Milla Jovovich, Jessica Biel, Luke Tennie, Richard Schiff, Teri Wyble, Al Sapienza"
            }

        ]
    },

    "Action":   {
        "title": "Action Movies",
        "intro": "These titles are really exciting!",
        "movies": [
            {
                "title": "Avengers: Infinity War",
                "plot": "Plot: The Avengers and all of their partners unite to assemble their power in order to fight the necessary battle against their biggest collective enemy, Thanos, before he can wreak his havoc across the entire world.
                Rated PG-13 by the Motion Picture Association of America for Action Violence, Crude Humor, Language, Sci-Fi Violence.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/203219.jpg",
                "cast": "Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Zoe Saldana"
            },

            {
                "title": "Rampage",
                "plot": "Plot: A primatologist strives to rescue his beloved and once-peaceful albino gorilla. After an evil genetic experiment goes awry, the gorilla and two other gigantic mutated animals run amok in downtown Chicago
                Rated PG-13 by the Motion Picture Association of America for Brief Strong Language, Crude Humor, Sequences of Disturbing Violence.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/202792.jpg",
                "cast": "Dwayne Johnson, Naomie Harris, Malin Akerman, Jake Lacy, Jeffrey Dean Morgan, Joe Manganiello, P.J. Byrne, Marley Shelton, Jack Quaid, Breanne Hill"
            },

            {
                "title": "The Magnificent Seven (2016)",
                "plot": "Plot: In this high-octane remake of the classic 1960 oater of the same name (itself a Western remake of "The Seven Samurai"), seven gunslingers protect a small town from a mining tycoon and his goons, who plan to seize the residents' land by force.
                Rated PG-13 by the Motion Picture Association of America for extended and intense sequences of Western violence, and for historical smoking, some language and suggestive material.",
                "price":"$3.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/10745.jpg",
                "cast": "Denzel Washington, Chris Pratt, Ethan Hawke, Vincent D'Onofrio, Byung-hun Lee"
            },

            {
                "title": "Captain America: Civil War",
                "plot": "Plot: Former teammates Iron Man and Captain America clash over a proposal that would make the Avengers accountable to government oversight. Soon, the rest of the Marvel heroes take sides in the conflict in this thrillingly epic comic-book adventure.
                Rated PG-13 by the Motion Picture Association of America for extended sequences of violence, action and mayhem.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/8166.jpg",
                "cast": "Chris Evans, Robert Downey, Scarlett Johansson, Sebastian Stan, Anthony Mackie"
            },

            {
                "title": "Jurassic World",
                "plot": "Plot: In this thrilling fourth installment of the "Jurassic Park" franchise, two young brothers visit an aunt who's an executive at Jurassic World, a theme park populated with genetically resurrected dinosaurs. But chaos erupts when a newly created dino escapes its enclosure, forcing the park's animal behaviorist to save the day.
                Rated PG-13 by the Motion Picture Association of America for intense sequences of science-fiction violence and peril.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/7563.jpg",
                "cast": ""
            }

        ]
    },

    "Classics":   {
        "title": "Classic Movies",
        "intro": "Here are some good o'l classic films",
        "movies": [
            {
                "title": "Forrest Gump (1994)",
                "plot": "Plot: Stupid is as stupid does, says Forrest Gump (played by Tom Hanks in an Oscar-winning performance) as he discusses his relative level of intelligence with a stranger while waiting for a bus. Despite his sub-normal IQ, Gump leads a truly charmed life, with a ringside seat for many of the most memorable events of the second half of the 20th century. Entirely without trying, Forrest teaches Elvis Presley to dance, becomes a football star, meets John F. Kennedy, serves with honor in Vietnam, meets Lyndon Johnson, speaks at an anti-war rally at the Washington Monument, hangs out with the Yippies, defeats the Chinese national team in table tennis, meets Richard Nixon, discovers the break-in at the Watergate, opens a profitable shrimping business, becomes an original investor in Apple Computers, and decides to run back and forth across the country for several years. Meanwhile, as the remarkable parade of his life goes by, Forrest never forgets Jenny (Robin Wright), the girl he loved as a boy, who makes her own journey through the turbulence of the 1960s and 1970s that is far more troubled than the path Forrest happens upon. Featured alongside Tom Hanks are Sally Field as Forrest's mother; Gary Sinise as his commanding officer in Vietnam; Mykelti Williamson as his ill-fated Army buddy who is familiar with every recipe that involves shrimp; and the special effects artists whose digital magic place Forrest amidst a remarkable array of historical events and people.
                Rated PG-13 by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/6324.jpg",
                "cast": "Tom Hanks, Robin Wright, Haley Joel Osment, Mykelti Williamson, Sally Field, Gary Sinise"
            },

            {
                "title": "Good Will Hunting",
                "plot": "Plot: A true motion picture phenomenon, this triumphant story was nominated for 9 Academy Awards® -- winning Oscars for Robin Williams (Best Supporting Actor) and hot newcomers Matt Damon and Ben Affleck (Best Original Screenplay). The most brilliant mind at America's top university isn't a student ... he's the kid who cleans the floors! Will Hunting (Damon) is a headstrong, working-class genius who's failing the lessons of life. After one too many run-ins with the law, Will's last chance is a psychology professor (Williams), who might be the only man who can reach him! With acclaimed performances from Academy Award®- nominee Minnie Driver (GROSSE POINTE BLANK) and Ben Affleck (ARMAGEDDON) -- you'll find GOOD WILL HUNTING a powerful and unforgettable movie experience!
                Rated R by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/3117.jpg",
                "cast": "Matt Damon, Robin Williams, Ben Affleck"
            },

            {
                "title": "Saving Private Ryan",
                "plot": "Plot: Steven Spielberg directed this powerful, realistic re-creation of WWII's D-day invasion and the immediate aftermath. The story opens with a prologue in which a veteran brings his family to the American cemetery at Normandy, and a flashback then joins Capt. John Miller (Tom Hanks) and GIs in a landing craft making the June 6, 1944, approach to Omaha Beach to face devastating German artillery fire. This mass slaughter of American soldiers is depicted in a compelling, unforgettable 24-minute sequence. Miller's men slowly move forward to finally take a concrete pillbox. On the beach littered with bodies is one with the name "Ryan" stenciled on his backpack. Army Chief of Staff Gen. George C. Marshall (Harve Presnell), learning that three Ryan brothers from the same family have all been killed in a single week, requests that the surviving brother, Pvt. James Ryan (Matt Damon), be located and brought back to the United States. Capt. Miller gets the assignment, and he chooses a translator, Cpl. Upham (Jeremy Davis), skilled in language but not in combat, to join his squad of right-hand man Sgt. Horvath (Tom Sizemore), plus privates Mellish (Adam Goldberg), Medic Wade (Giovanni Ribisi), cynical Reiben (Edward Burns) from Brooklyn, Italian-American Caparzo (Vin Diesel), and religious Southerner Jackson (Barry Pepper), an ace sharpshooter who calls on the Lord while taking aim. Having previously experienced action in Italy and North Africa, the close-knit squad sets out through areas still thick with Nazis. After they lose one man in a skirmish at a bombed village, some in the group begin to question the logic of losing more lives to save a single soldier. The film's historical consultant is Stephen E. Ambrose, and the incident is based on a true occurance in Ambrose's 1994 bestseller D-Day: June 6, 1944.
                Rated R by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/1475.jpg",
                "cast": "Tom Hanks, Tom Sizemore, Matt Damon, Adam Goldberg, Barry Pepper, Max Martini, Edward Burns"
            },

            {
                "title": "Gladiator",
                "plot": "Plot: A man robbed of his name and his dignity strives to win them back, and gain the freedom of his people, in this epic historical drama from director Ridley Scott. In the year 180, the death of emperor Marcus Aurelius (Richard Harris) throws the Roman Empire into chaos. Maximus (Russell Crowe) is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus (Joaquin Phoenix) ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences. His battle skills serve him well, and he becomes one of the most famous and admired men to fight in the Colosseum. Determined to avenge himself against the man who took away his freedom and laid waste to his family, Maximus believes that he can use his fame and skill in the ring to avenge the loss of his family and former glory. As the gladiator begins to challenge his rule, Commodus decides to put his own fighting mettle to the test by squaring off with Maximus in a battle to the death. Gladiator also features Derek Jacobi, Connie Nielsen, Djimon Hounsou, and Oliver Reed, who died of a heart attack midway through production.
                Rated R by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/1345.jpg",
                "cast": "Russell Crowe, Joaquin Phoenix, Djimon Hounsou, Oliver Reed, Derek Jacobi, Connie Nielsen"
            },

            {
                "title": "Apollo 13",
                "plot": "Plot: Stranded 205,000 miles from Earth in a crippled spacecraft, astronauts Jim Lovell (Tom Hanks), Fred Haise (Bill Paxton) and Jack Swigert (Kevin Bacon) fight a desperate battle to survive. Meanwhile, at Mission Control, astronaut Ken Mattingly (Gary Sinise), flight director Gene Kranz (Ed Harris) and a heroic ground crew race against time - and the odds - to bring them home.
                Rated PG by the Motion Picture Association of America.",
                "price":"$3.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/2867.jpg",
                "cast": "Tom Hanks, Bill Paxton, Kevin Bacon"
            }

        ]
    },

    "Horror":   {
        "title": "Horror",
        "intro": "You may not sleep well tonight...",
        "movies": [
            {
                "title": "Gehenna: Where Death Lives",
                "plot": "Plot: A group scouting locations on a remote island come across a cave-like structure on the property they want. Armed with cameras, they enter the cursed bunker that appears to be an old war structure, but horrifying secrets and mysteries await them inside.
                Not Rated by the Motion Picture Association of America.",
                "price":"$2.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/205526.jpg",
                "cast": "Doug Jones, Katherine Wallace, Lance Henriksen, Patrick Gorman, Simon Phillips, Sean Sprawling, Justin Gordon, Eva Swan, Masashi Odate, George Kamea"
            },

            {
                "title": "Demons",
                "plot": "Plot: In this disquieting horror film, a married couple running a bed-and-breakfast find themselves haunted by the ghost of the wife's younger sister, who died eight years earlier in a failed exorcism overseen by the husband.
                Not Rated by the Motion Picture Association of America.",
                "price":"$2.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/204225.jpg",
                "cast": "Miles Doleac, Lindsay Anne, Willams Steven Brand"
            },

            {
                "title": "Blumhouse's Truth or Dare",
                "plot": "Plot: An innocuous game among friends turns into a fight for survival when a group of friends playing "Truth or Dare" are mysteriously killed if they don't carry out the dare or say the truth. Now, the remaining players must find the person who started the twisted game before it is their turn to die.
                Rated PG-13 by the Motion Picture Association of America for Disturbing Images, Sexuality, Thematic Elements, Violence.",
                "price":"$2.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/204613.jpg",
                "cast": "Lucy Hale, Tyler Posey, Tyler Garcia, Posey Violett Beane"
            },

            {
                "title": "The Bad Nun",
                "plot": "Plot: A young woman in need of some relaxation spends a night at an isolated bed-and-breakfast that used to be a convent. Throughout the stay she is visited by a nun, who progressively begins to reveal her true colors as the night unfolds.
                Not Rated by the Motion Picture Association of America.",
                "price":"$2.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/205520.jpg",
                "cast": "Becca Hirani, Lucy Chappell, Cassandra French, Georgia Woodthorpe, Patsy Prince"
            },

            {
                "title": "The Hollow Child",
                "plot": "Plot: Samantha is a foster child traveling from foster home to foster home. Upon arriving at her most recent abode, she meets her new foster sister, Olivia. She leaves Olivia who enters into the woods and disappears. After three days, Olivia returns and things get rather peculiar.
                Not Rated by the Motion Picture Association of America.",
                "price":"$2.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/205529.jpg",
                "cast": "Jessica McLeod, Hannah Cheramy, John Emmet Tracy"
            }
        ]
    },

    "Featured Films":   {
        "title": "Movies on Sale",
        "intro": "Check these movies out today on sale!",
        "movies": [
            {
                "title": "The Big Lebowski",
                "plot": "Plot: From the Academy Award-winning Coen brothers, The Big Lebowski is a hilariously quirky comedy about bowling, a severed toe, White Russians and a guy named...The Dude. Jeff "The Dude" Lebowski doesn’t want any drama in his life...heck, he can’t even be bothered with a job. But, he must embark on a quest with his bowling buddies after his rug is destroyed in a twisted case of mistaken identity. Starring Jeff Bridges, John Goodman, Julianne Moore, Steve Buscemi, Philip Seymour Hoffman and John Turturro, experience the cultural phenomenon of The Dude in the "#1 cult film of all time!" (The Boston Globe)
                 Rated R by the Motion Picture Association of America.",
                "price":"$1.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/4175.jpg",
                "cast": "Jeff Bridges, John Goodman, Steve Buscemi, Julianne Moore, Peter Stormare, John Turturro, David Huddleston, Sam Elliott, Philip Seymour Hoffman, Flea, Ben Gazzara, David Thewlis, Tara Reid"
            },

            {
                "title": "Rocky",
                "plot": "Plot: Sylvester Stallone became an instant superstar with his portrayal of the underdog boxer who gets a million-to-one shot at boxing's World Heavyweight crown...and comes out a winner.
                 Rated PG by the Motion Picture Association of America.",
                "price":"$1.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/1328.jpg",
                "cast": "Burt Young, Stan Shaw, Frank Stallone, Christopher Avildsen, David Thayer, Joe Frazier, Joe Spinell, Larry Carroll, Carl Weathers, Burgess Meredith"
            },

            {
                "title": "Braveheart",
                "plot": "Plot: Braveheart, Mel Gibson's richly detailed, Academy Award®-winning saga of fierce combat, tender love and the will to risk it all for freedom, is now a digitally remastered, two-disc Special Collector's Edition DVD bursting with dynamic new special features. In an emotionally charged performance, Gibson is William Wallace, a bold Scotsman who uses the steel of his sword and the fire of his intellect to rally his countrymen to liberation from the English occupation of Scotland. Winner of five Oscars® -- Best Picture of 1995, Best Director (Gibson), Best Cinematography, Best Makeup and Best Sound Effects Editing -- "Braveheart" is "the most sumptuous and involving historical epic since 'Lawrence of Arabia'" (Rod Lurie, Los Angeles Magazine).
                 Rated R by the Motion Picture Association of America.",
                "price":"$1.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/8461.jpg",
                "cast": "Sophie Marceau, Patrick McGoohan, Mel Gibson, Catherine McCormack, Sean Lawlor"
            },

            {
                "title": "American Beauty",
                "plot": "Plot: Lester decides to make a few changes in his life; the freer he gets, the happier he gets. But Lester is about to learn that the ultimate freedom comes at the ultimate price.
                 Rated R by the Motion Picture Association of America.",
                "price":"$1.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/204123.jpg",
                "cast": "Chris Cooper, Allison Janney, Annette Bening, Kevin Spacey, Peter Gallagher, Wes Bentley, Mena Suvari, Scott Bakula, Thora Birch, Sam Robards"
            },

            {
                "title": "Pulp Fiction",
                "plot": "Plot: Critics and audiences worldwide hailed PULP FICTION as the star-studded picture that redefined cinema in the 20th Century! Writer/director Quentin Tarantino (Academy Award Winner -- Best Original Screenplay, 1994) delivers an unforgettable cast of characters -- including a pair of low-rent hit men (John Travolta and Samuel L. Jackson), their boss's sexy wife (Uma Thurman), and a desperate prizefighter (Bruce Willis) -- in a wildly entertaining and exhilarating motion picture adventure that both thrills and amuses!
                 Rated R by the Motion Picture Association of America.",
                "price":"$1.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/8538.jpg",
                "cast": "Uma Thurman, Samuel L. Jackson, John Travolta"
            }
        ]
    },

    "Fan Favorites":   {
        "title": "Fan Favorites",
        "intro": "Our most popular movies!!!",
        "movies": [
            {
                "title": "Titanic",
                "plot": "Plot: Leonardo DiCaprio and Oscar-nominatee Kate Winslet light up the screen as Jack and Rose, the young lovers who find one another on the maiden voyage of the "unsinkable" R.M.S. Titanic. But when the doomed luxury liner collides with an iceberg in the frigid North Atlantic, their passionate love affair becomes a thrilling race for survival. From acclaimed filmmaker James Cameron comes a tale of forbidden love and courage in the face of disaster that triumphs as a true cinematic masterpiece.
                 Rated PG-13 by the Motion Picture Association of America.",
                "price":"$4.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/6860.jpg",
                "cast": "Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates, Frances Fisher"
            },

            {
                "title": "The Matrix",
                "plot": "Plot: Have you ever had a dream that you were so sure was real? What if you couldn't awaken? How would you know the difference between dream and reality? When a beautiful stranger (Carrie Ann Moss) leads computer hacker Neo (Keanu Reeves) to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence. Neo joins legendary and dangerous rebel warrior Morpheus (Lawrence Fishburne) in the battle to destroy the illusion enslaving humanity. Now, every move, every second, every thought becomes a fight to stay alive--to escape The Matrix.
                Rated R by the Motion Picture Association of America.",
                "price":"$4.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/1591.jpg",
                "cast": "Keanu Reeves, Carrie-Anne Moss, Laurence Fishburne, Hugo Weaving, Joe Pantoliano"
            },

            {
                "title": "Old School",
                "plot": "Plot: Before you can say wild and wet wrestling, Frank The Tank (Will Ferrell, Saturday Night Live), Mitch (Luke Wilson, Legally Blonde) and Beanie (Vince Vaughn, Swingers) have their own frat raging with out-of-control antics, But when things get too wild, the dean sets out to shut them down.
                Rated R by the Motion Picture Association of America.",
                "price":"$4.99",
                "cover":"https://images.redbox.com/Images/EPC/boxartvertical/204158.jpg",
                "cast": "Luke Wilson, Will Ferrell, Vince Vaughn, Jeremy Piven, Ellen Pompeo, Juliette Lewis, Leah Remini"
            },

            {
                "title": "Catch Me If You Can",
                "plot": " Play Trailer
                Plot: Frank didn't go to flight school...Frank didn't go to medical school...Frank didn't go to law school...because Frank’s still in high school! Inspired by the true story of a brilliant young master of deception and the FBI agent hot on his trail. Directed by Steven Spielberg and starring Leonardo DiCaprio and Tom Hanks. Frank W. Abagnale, Jr. successfully passes himself off as a pilot, a lawyer and a doctor – all before his 21st birthday!
                Rated PG-13 by the Motion Picture Association of America.",
                "price":"$4.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/1362.jpg",
                "cast": "Leonardo DiCaprio, Tom Hanks, Nathalie Baye, Martin Sheen, Christopher Walken"
            },

            {
                "title": "Major League",
                "plot": "Plot: She’s beautiful, smart, goal-oriented, and she just inherited the Cleveland Indians. Unfortunately, she wants to move the franchise to Miami, and a losing season is her only ticket to Florida.
                Rated R by the Motion Picture Association of America.",
                "price":"$4.99",
                "cover": "https://images.redbox.com/Images/EPC/boxartvertical/3504.jpg",
                "cast": "Tom Berenger, Charlie Sheen, Corbin Bernsen"
            }
        ]
    }
}

